[
  {
    "global": {
      "title": "CryptoShalix. Portfolio",
      "titleCopyright": "CryptoShalix. Portfolio",
      "knowMore": "About",
      "languagesTooltip": "English -> Spanish",
      "github": "Follow me on Github: @CryptoShalix"
    },
    "nav": {
      "home": "Projects",
      "about": "About",
      "contact": "Contact"
    },
    "pages": {
      "main": {
        "title": "Portfolio",
        "projects": {
          "bitakashico": "BitAkashico is presented as the main project of @CryptoShalix, and aspires to become the place where we can find the necessary tools to understand ourselves <i>(Akasha)</i> and the digital and financial world that changes so much <i>(Bit)</i>.<br/><br/>Developed in Angular, with all styles and components created from scratch, without external libraries. Data is loaded dynamically from .json files. All logic, design and translations are the work of CryptoShalix.",
          "corazondejazmyn": "Corazón de Jazmyn presents Jazmyn's art on a simple and direct website, which makes it easy to view the creations and contact to place the desired orders.<br/><br/>Developed in Angular, with all the styles and components created from scratch, without external libraries. The data and images in the gallery are loaded dynamically from .json files. All logic, design and translations are the work of CryptoShalix.",
          "encuentratufuerza": "Ana presents us with a project that allows you to heal your family tree and any wound or trauma that the clan was carrying through <i>'the constellation of the seven generations'</i>.<br/><br/>Developed with HTML, CSS and JQuery. Without external libraries or frameworks. They are all components loaded using JavaScript, dynamically. All logic, design and translations are the work of CryptoShalix.",
          "financemanager": "Application to manage personal finances from the browser, without registration, but with your data saved in an encrypted file that you can take wherever you want.<br/><br/>Purchases, transfers, investments... whatever you want in one place, and with its equivalent value in the main currencies (USD and BTC).<br/><br/>Developed in Angular, with all styles and components created from scratch, without external libraries. Data is loaded dynamically from .json files. All logic, design and translations are the work of CryptoShalix."
        }
      },
      "about": {
        "title": "About me",
        "nickname_title": "CryptoShalix? Where does that name come from?",
        "nickname": "CryptoShalix is ​​a nickname that comes from the union of the words <b><i>Crypto</i></b>, an abbreviation for cryptography, and <b><i>Shalix</b></i>, a nickname that was born as a teenager.<br/><br/>Cryptography is applied both to computer issues <i>(e.g. password generation)</i> and to <b>de-encrypt</b> the messages that They are received when channeling <i>(conversations with the soul)</i>.",
        "story_tech_title": "What is my relationship with <i>technology</i>?",
        "story_tech": "Since I was 10 years old, with my first computer, I started playing and practicing with everything related to software.<br/><br/>At 17 years old I started creating all-in-one application installers, and some other web with <b>html</b> and <b>javascript</b>.<br/>In the <i><b>Higher Degree in Telecommunications</b></i> I really fell in love with programming, computer systems and software in general.<br/><br/>After training as a <i>Programmer Analyst</i>, I joined <b>Alten Spain</b>, my first job, where I learned new languages ​​<i>(.Net: with C# and VB)</i> and improved my skills in other areas, such as communication <i>(both when expressing myself and in English)</i>, and the management of tasks and resources.<br/><br/>Several years later, upon finishing the <b><i>Higher Degree in multiplatform applications</b></i>, my level of programming and development of applications, both web and mobile, improved to the level of being able to carry out complete development from scratch.<br/><br/>Thus, I became part of a startup, <b>Miotek Factory</b>, in which I collaborated with native Android developments in Java and some support to colleagues with web pages <i>(especially in UI/UX issues).<br/>It was a short but very productive period in terms of contacts and learning.<br/><br/>Since July 2017, my family, in the workplace, was <b>Avantgarde IT</b>, a place where I developed: <b>team management skills/b>; complete developments with <b>databases <i>(SQL Server, Oracle)</i></b>; <b>API/REST services with .Net <i>(Framework and Core)</i></b>; and frontend; both with <i><b>Angular, React, and Vue</b> as well as with C#, using Webforms and MVC</i>.<br/><br/>More than 30 different clients, each with its own methodology of work, task management, and problems to be solved, and all satisfied clients with positive results.<br/><br/>If you have problems with your computer or mobile phone, or if you have an application or website in mind, but not If you know where to start, you can <b>hire</b> the services of <b>application/web page development</b>, or <b>computer support</b>, by filling out the form on the tab contact.",
        "story_spirit_title": "What is my relationship with <i>spirituality</i>?",
        "story_spirit": "I still have the letter written for school, describing what my summer had been like that year, in which, innocently, I added my feeling when saying goodbye to my <b><i>invisible friends</i></b>, as I used to call them, after almost 11 years watching them, learning and playing with them.<br/><br/><b>Learning</b>?<br/>Yes. Some were children; naughty and playful, or fearful, or chubby and always eating sweets, but there was one in particular, who <b>EVERYONE respected</b>: <i>tall, intelligent, clean, and always with admirable wisdom</i>.<br/><br/>His advice was like: '<i>Do you see that glass on the corner of the table? If you hit it, it will break. Move it more towards the center of the table, to avoid scares.</i>'<br/><br/>This is just an example, but I was educating myself with advice like this, from a very young age.<br/><br/>I was lucky to have open-minded parents, and with friends who guided them along the path of <b>awareness</b>, warning them <b>NOT to medicate their child</b>, and not worry about <strike>that curse</strike> <i>that gift</i> of seeing people who do not exist in this world.<br/><br/>My mother always told me <i>(and she still does when we remember the topic)</i>, that I was like an old man in a child's body, and who learned more from me than from some books.<br/><br/>After saying goodbye at 11 years old, I didn't had contact again with nothing in the spiritual realm, reaching the point of becoming <i>agnostic</i>.<br/><br/>And we came to the interesting part of the story, when I met my current life partner <a href='https://corazondejazmyn.github.io/site' target='_blank'>Corazon de Jazmyn</a>, in Madrid, after the 2020 quarantine.<br/>A few months after we met and started a more formal relationship, she increased her interest in the spiritual world, religions, chakras, auras, etc.<br/><br/>Here it began, playing in the bathtub to see each other aura, my path as <b>soul channeler</b>.<br/><br/><b>How?!</b><br/>At first it was just the aura, then I began to glimpse shapes <i>(a tree, a bird, etc)</i>, and then I discovered that not only could I move through that world, but I received responses from those birds, trees, etc.<br/>While it is true that at the beginning I had to memorize everything and then explain it to the <i>client</i>, as time went by, and as I made +100 records to so many people <i>(always non-profit)</i>, I developed that talent even more, to the point of being able to speak as if it were a normal conversation.<br/><br/>If you have any obstacles in your life, go to <a href='https://cryptoshalix.github.io/BitAkashico/#/testimonials' target='_blank'>BitAkashico</a> and look at the testimonials, or directly schedule your appointment by filling out the form in the contact tab."
      },
      "contact": {
        "title": "Contact",
        "fieldNickname": "* Nme/Nickname",
        "fieldEmail": "* Email",
        "fieldPhone": "Phone/Telegram Id",
        "fieldMessage": "* Message",
        "btnSend": "Send",
        "msgDataSharing": "The contact data provided will NOT be shared or stored",
        "msgFieldEmpty": "This field is required",
        "msgError": "The message coundn't be sent. Check the fields and try again.",
        "msgSuccess": "The message has been sent correctly.<br/>I will respond as soon as possible to the contact provided. Thank you"
      }
    },
    "footer": {
      "copyright": "2024 - All rights reserved",
      "credits": "Developed with <i class='fa fa-heart red'></i> by <a target='_blank' href='https://linktr.ee/BitAkashico'>@CryptoShalix</a>"
    }
  }
]